# Pandas는 무엇인가요_20221109
- 데이터 분석 및 가공에 사용되는 파이썬 라이브러리

In [14]:
import pandas as pd

pd.__version__

'1.3.5'

In [18]:
data_frame = pd.read_csv('data/friend_list.csv')
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## 데이터 프레임_20221109
- 가로축과 세로축이 있는 엑셀과 유사한 데이터 구조
- 가로축은 row(행), 세로축은 column(열)
- 데이터베이스의 테이블 구조

In [22]:
# 데이터프레임이 가지고 있는 함수의 예제
data_frame.head(3) # default : 5 개를 보여줌 (R은 6개)

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## 시리즈(Series)_20221109
- 데이터 프레임의 컬럼(열)은 모두 시리즈.
- 단순히 파이썬 리스트를 간직한 오브젝트.
- 리스트를 파라미터로 주면 바로 시리즈가 생성.
- 데이터 가공 및 분석이 파이썬 리스트보다 훨씬 많다.

In [25]:
type(data_frame.job) # pandas.core.series.Series # 대문자 Series 클래스

pandas.core.series.Series

In [27]:
# 시리즈의 함수 예제
data_frame.job = data_frame.job.str.upper()
data_frame.head()

    name  age        job
0   John   20    STUDENT
1  Jenny   30  DEVELOPER
2   Nate   30    TEACHER
3  Julia   40    DENTIST
4  Brian   45    MANAGER

In [30]:
s1 = pd.core.series.Series(['one', 'two', 'three'])
s2 = pd.core.series.Series([1,2,3])

In [31]:
pd.DataFrame(data=dict(word=s1, num=s2))

    word  num
0    one    1
1    two    2
2  three    3

In [33]:
df = pd.read_csv('data/friend_list.txt')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [35]:
# 구분자에 의해 컬럼이 구분되어져 있는 데이터는 모두 지원
df = pd.read_csv('data/friend_list_tab.txt', delimiter='\t') # delimiter = 구분자 # R에서도 delimiter 매개변수 사용
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [39]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None) 
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

In [40]:
df.columns = ['name','age','job']
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [41]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name','age','job']) 
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager